apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_himem.c
static spinlock_t g_descriptor_lock = SP_UNLOCKED;
static ramblock_t *g_ram_descriptor = NULL;
static rangeblock_t *g_range_descriptor = NULL;
static int g_ramblockcnt = 0;
static const int g_rangeblockcnt = SPIRAM_BANKSWITCH_RESERVE;

/* Used by the spinlock */

irqstate_t spinlock_flags;

static const struct file_operations g_himemfops =
{
  NULL,             /* open   */
  NULL,             /* close */
  himem_read,       /* read */
  himem_write,      /* write */
  NULL,             /* seek */
  himem_ioctl,      /* ioctl */
};

/****************************************************************************
 * Private functions
 ****************************************************************************/

/****************************************************************************
 * Name: ramblock_idx_valid
 *
 * Description:
 *   Check whether RAM block is valid.
 *
 * Input Parameters:
 *   ramblock_idx - RAM block index.
 *
 * Returned Value:
 *   True if blocks can be allocated, false if not.
 *
 ****************************************************************************/

static inline bool ramblock_idx_valid(int ramblock_idx)
{
  return (ramblock_idx >= 0 && ramblock_idx < g_ramblockcnt);
}

/****************************************************************************
 * Name: rangeblock_idx_valid
 *
 * Description:
 *   Check whether virtual block is valid.
 *
 * Input Parameters:
 *   rangeblock_idx - Range block index.
 *
 * Returned Value:
 *   True if blocks can be allocated, false if not.
 *
 ****************************************************************************/

static inline bool rangeblock_idx_valid(int rangeblock_idx)
{
  return (rangeblock_idx >= 0 && rangeblock_idx < g_rangeblockcnt);
}

/****************************************************************************
 * Name: esp_himem_get_range_start
 *
 * Description:
 *   Get the virtual address range reserved for himem use.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Range of reserved virtual address.
 *
 ****************************************************************************/

static uint32_t esp_himem_get_range_start(void)
{
  return (esp_spiram_allocable_vaddr_end() -
          MMU_PAGE_TO_BYTES(SPIRAM_BANKSWITCH_RESERVE));
}

/****************************************************************************
 * Name: esp_himem_get_range_block
 *
 * Description:
 *   Get MMU blocks reserved for himem use.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Number of reserved MMU blocks.
 *
 ****************************************************************************/

static uint32_t esp_himem_get_range_block(void)
{
  return (BYTES_TO_MMU_PAGE(esp_spiram_allocable_vaddr_end()
                            - SOC_EXTRAM_DATA_LOW)
                            - SPIRAM_BANKSWITCH_RESERVE);
}

/****************************************************************************
 * Name: esp_himem_get_phy_block
 *
 * Description:
 *   Get physical RAM blocks.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   Physical RAM blocks.
 *
 ****************************************************************************/

static uint32_t esp_himem_get_phy_block(void)
{
  return (BYTES_TO_MMU_PAGE(esp_spiram_allocable_vaddr_end()
                            - esp_spiram_allocable_vaddr_start())
                            - SPIRAM_BANKSWITCH_RESERVE);
}

/****************************************************************************
 * Name: allocate_blocks
 *
 * Description:
 *   Allocate count not-necessarily consecutive physical RAM blocks.
 *
 * Input Parameters:
 *   count      - Numbers of blocks
 *   blocks_out - Pointer numbers in blocks[]
 *
 * Returned Value:
 *   True if blocks can be allocated, false if not.
 *
 ****************************************************************************/

static bool allocate_blocks(int count, uint16_t *blocks_out)
{
  int n = 0;
  int i;

  for (i = 0; i < g_ramblockcnt && n != count; i++)
    {
      if (!g_ram_descriptor[i].is_alloced)
        {
          blocks_out[n] = i;
          n++;
        }
    }

  if (n == count)
    {
      /* All blocks could be allocated. Mark as in use. */

      for (i = 0; i < count; i++)
        {
          g_ram_descriptor[blocks_out[i]].is_alloced = true;
          DEBUGASSERT(g_ram_descriptor[blocks_out[i]].is_mapped  == false);
        }

      return true;
    }
  else
    {
      /* Error allocating blocks */

      return false;
    }
}

/****************************************************************************
 * Name: himem_read
 ****************************************************************************/

static ssize_t himem_read(struct file *filep, char *buffer,
                          size_t buflen)
{
  return -ENOSYS;
}

/****************************************************************************
 * Name: himem_write
 ****************************************************************************/

static ssize_t himem_write(struct file *filep, const char *buffer,
                          size_t buflen)
{
  return -ENOSYS;
}

/****************************************************************************
 * Name: himem_ioctl
 ****************************************************************************/

static int himem_ioctl(struct file *filep, int cmd, unsigned long arg)
{
  int ret = OK;

  switch (cmd)
    {
      /* Allocate the physical RAM blocks */

      case HIMEMIOC_ALLOC_BLOCKS:
        {
          struct esp_himem_par *param =
                     (struct esp_himem_par *)((uintptr_t)arg);

          DEBUGASSERT(param != NULL);

          /* Allocate the memory we're going to check. */

          ret = esp_himem_alloc(param->memfree, &(param->handle));
          if (ret < 0)
            {
              minfo("Error: esp_himem_alloc() failed!\n");
              return ret;
            }
        }
        break;

      /* Free the physical RAM blocks */

      case HIMEMIOC_FREE_BLOCKS:
        {
          struct esp_himem_par *param =
                     (struct esp_himem_par *)((uintptr_t)arg);

          DEBUGASSERT(param != NULL);

          ret = esp_himem_free(param->handle);
          if (ret < 0)
            {
              minfo("Error: esp_himem_free() failed!\n");
              return ret;
            }
        }
        break;

